# GetLevelTemplateName

## Description
Returns the name of the nth Story Level Template in the file. For example, if 3 is passed in, it will return the name of the 3rd Story Level Template in the file.

```pascal
FUNCTION GetLevelTemplateName(index : INTEGER): STRING;
```

```python
def vs.GetLevelTemplateName(index):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|index|INTEGER|The index of the Story Level Template whose name is to be returned.|

## Examples
```pascal
VAR

templateName:STRING;

BEGIN

templateName:=GetLevelTemplateName(2);
```

```pascal
resultStr := GetLevelTemplateName(1);
```
```python
import vs

# Returns the name of the nth Story Level Template in the file.
index = 1

name = vs.GetLevelTemplateName(index)
vs.Message('GetLevelTemplateName returned: ' + str(name))
```

## See Also
VS Functions:
GetNumLevelTemplates
| SetLevelTemplateName
| CreateLevelTemplate
| DeleteLevelTemplate
| GetLevelTemplateInfo

## Version
Availability: from Vectorworks 2015

## Category
* Layers